controllers/ObatController.php

    public function actionCreate()
    {
        $model = new ObatAuroM();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO "obat_auro_m" ("nama_obat", "jenis_obat", "deskripsi_obat", "stock_obat", "satuan_obat", "harga_obat") VALUES ('iodine', 'Obat Bebas', 'Ini adalah obat bebas penggunaan', 10, 'Botol', 2000) RETURNING "id_obat"

    protected function findModel($id_obat)
    {
        if (($model = ObatAuroM::findOne(['id_obat' => $id_obat])) !== null) {
---
SELECT * FROM "obat_auro_m" WHERE "id_obat"='6'