controllers/PembelianController.php

    public function actionCreate()
{
    $model = new PembelianObat();

    if ($model->load(Yii::$app->request->post())) {
        if ($model->validate()) {
            // Simpan data pembelian
            if ($model->save()) {
                // Update stok obat di ObatAuroM
                $obat = ObatAuroM::findOne(['id_obat' => $model->id_obat]);
                if ($obat) {
                    $obat->stock_obat += $model->banyak_dibeli;
                    // Update harga_obat dari harga_beli
                    $obat->harga_obat = $model->harga_beli;
                    $obat->save();
---
SELECT EXISTS(SELECT * FROM "obat_auro_m" WHERE "obat_auro_m"."id_obat"='6')
SELECT * FROM "obat_auro_m" WHERE "id_obat"='6'
UPDATE "obat_auro_m" SET "stock_obat"=110, "harga_obat"=3000 WHERE "id_obat"=6