controllers/PenjualanController.php

    public function actionCreate()
{
    $model = new PenjualanObat();

    if ($this->request->isPost) {
        if ($model->load($this->request->post()) && $model->validate()) {
            // Ambil harga_jual terbaru dari PembelianObat berdasarkan nama_obat
            $pembelianObat = PembelianObat::find()
                ->where(['id_obat' => $model->nama_obat])
                ->orderBy(['id_pembelian' => SORT_DESC])
                ->one();

            if ($pembelianObat) {
                $model->harga_pembelian = $pembelianObat->harga_jual * $model->banyak_pembelian;
            }

            if ($model->save()) {
                // Mengurangi stok obat di ObatAuroM
                $obat = ObatAuroM::findOne(['nama_obat' => $model->nama_obat]);
---
SELECT * FROM "obat_auro_m" WHERE "nama_obat"='6'

    $pdf->Cell($col2Width, 10, $model->nama_pembeli, 1);
    $pdf->Ln();

    $medicineModel = ObatAuroM::findOne($model->nama_obat);
---
SELECT * FROM "obat_auro_m" WHERE 0=1