models/PembelianObat.php

    public function beforeSave($insert)
    {
        if (parent::beforeSave($insert)) {
            // Mengambil data obat terkait
            $obat = ObatAuroM::findOne(['id_obat' => $this->id_obat]);
---
SELECT * FROM "obat_auro_m" WHERE "id_obat"='6'

    public function afterSave($insert, $changedAttributes)
    {
        parent::afterSave($insert, $changedAttributes);

        // Update harga_obat di ObatAuroM dengan harga_beli saat pembelian
        if ($insert) { // Hanya berlaku jika ini adalah pembelian baru
            $obat = ObatAuroM::findOne(['id_obat' => $this->id_obat]);
            if ($obat) {
                $obat->harga_obat = $this->harga_beli;
                $obat->save();
---
SELECT * FROM "obat_auro_m" WHERE "id_obat"='6'
UPDATE "obat_auro_m" SET "harga_obat"=3000 WHERE "id_obat"=6